---
kind: enumMember
id: F:Autodesk.Revit.DB.RoutingPreferenceErrorLevel.Warning
enum: Autodesk.Revit.DB.RoutingPreferenceErrorLevel
zh: 警告
source: html/37b1540d-5fe8-7666-b284-4f8d11c14f45.htm
---
# Autodesk.Revit.DB.RoutingPreferenceErrorLevel.Warning

**中文**: 警告

Post Revit warnings if there is no rule in the routing preference satisfying the current condition.